tap "homebrew/bundle"
brew "powerlevel10k"
brew 'go'             # Compiler for Go Lang
brew 'node'           # Node.js
brew 'nvm'            # Switching node versions
brew 'python'         # Python interpreter
brew 'rust'           # Rust language
brew 'docker'         # Containers
cask 'spotify', args: { require_sha: false } # Propietary music streaming
cask 'firefox'
cask 'chromium'
vscode "digitalbrainstem.javascript-ejs-support"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-vscode.cpptools"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
